src/cf/Enums/СостоянияБроней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияБроней</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СостоянияБроней/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает индекс в коллекции картинок "Состояния броней" для указанного состояния брони.
//
// Параметры:
//  СостояниеБрони - ПеречислениеСсылка.СостоянияБроней - Состояние брони.
// 
// Возвращаемое значение:
//  Число - Индекс в коллекции картинок "Состояния броней".
//
Функция ИндексКартинки(СостояниеБрони) Экспорт
	
	Если СостояниеБрони = ОжидаетПодтверждения Тогда
		ИндексКартинки = 0;
	ИначеЕсли СостояниеБрони = Отменена Тогда
		ИндексКартинки = 1;
	ИначеЕсли СостояниеБрони = Подтверждена Тогда
		ИндексКартинки = -1;
	Иначе
		ИндексКартинки = -1;
	КонецЕсли;
	
	Возврат ИндексКартинки;
	
КонецФункции

// Возвращает картинку для указанного состояния брони.
//
// Параметры:
//  СостояниеБрони - ПеречислениеСсылка.СостоянияБроней - Состояние брони.
// 
// Возвращаемое значение:
//  Картинка, Неопределено - Картинка состояния. Если картинка не задана, возвращает Неопределено.
//
Функция Картинка(СостояниеБрони) Экспорт
	
	Если СостояниеБрони = ОжидаетПодтверждения Тогда
		Картинка = БиблиотекаКартинок.СостояниеБрониОжидаетПодтверждения;
	ИначеЕсли СостояниеБрони = Отменена Тогда
		Картинка = БиблиотекаКартинок.СостояниеБрониОтменена;
	ИначеЕсли СостояниеБрони = Подтверждена Тогда
		Картинка = Новый Картинка();
	Иначе
		Картинка = Новый Картинка();
	КонецЕсли;
	
	Возврат Картинка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
